---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewTypeBinding
source: html/190161e1-615b-75ba-a6cf-f3a1b6d6fb4f.htm
---
# Autodesk.Revit.Creation.Application.NewTypeBinding Method

Creates a new empty type binding object.

## Syntax (C#)
```csharp
public TypeBinding NewTypeBinding()
```

## Returns
A new type binding object.

## Remarks
Type binding objects are used for attaching shared parameter definitions to a type
within a category. Categories can be added to the instance binding via the Categories property of
the InstanceBinding object